UPPERBOUND = 999999999999
notNumberErrorMsg = '** This in not a integer number'
tooBigNumberErrorMsg = '** Number you entered is too big'
zeroUkr = 'нуль'

singlesUkr = {'0': '', '1': 'один', '2': 'два', '3': 'три', '4': 'чотири', '5': 'п\'ять',
              '6': 'шість', '7': 'сім', '8': 'вісім', '9': 'дев\'ять', '10': 'десять', '11': 'одинадцять',
              '12': 'дванадцять', '13': 'тринадцять', '14': 'чотирнадцять', '15': 'п\'тнадцять',
              '16': 'шістнадцять', '17': 'сімнадцять', '18': 'вісімнадцять', '19': 'дев\'ятнадцять'}
tensUrk = {'2': 'двадцять', '3': 'тридцять', '4': 'сорок', '5': 'п\'тдесят', '6': 'шістдесят', '7': 'сімдесят',
           '8': 'вісімдесят', '9': 'дев\'яносто'}
hundredsUkr = {'1': 'сто', '2': 'двісті', '3': 'триста', '4': 'чотириста', '5': 'п\'ятсот', '6': 'шістсот',
               '7': 'сімсот', '8': 'вісімсот', '9': 'дев\'ятсот'}

decimalCases = {0: '', 1: '', 2: '', 3: '', 4: ''}
thousandCases = {0: 'тисяч', 1: 'тисяча', 2: 'тисячі', 3: 'тисячі', 4: 'тисячі'}
millionCases = {0: 'мільонів', 1: 'мільон', 2: 'мільони', 3: 'мільони', 4: 'мільони'}
billionCases = {0: 'мільярдів', 1: 'мільярд', 2: 'мільярди', 3: 'мільярди', 4: 'мільярди'}

triads = {0: decimalCases,
          1: thousandCases,
          2: millionCases,
          3: billionCases}
